import * as Sequelize from 'sequelize'


// 建立数据库连接
var seq = new Sequelize(
    'Sequelize', // .................................... 数据库名
    'root', // ......................................... 用户名
    '123', // .......................................... 用户密码
    {
        'dialect': 'mysql', // ......................... 数据库使用mysql
        'host': 'localhost', // ........................ 数据库服务器ip
        'port': 3306, // ............................... 数据库服务器端口
        'define': {
            'underscored': true // ....................... 字段以下划线"_"来分割；默认:驼峰命名
        }
    }
)
// dialect：n. 方言，土话；同源语；行话；个人用语特征
// new Sequelize()连接数据库后，seq则是1个数据库操作实例。
// 什么叫数据库操作实例？
// 即是说，你对这个对象所写的Sequelize代码，均会转换成对应的MySQL语句，不用怀疑！

export = seq














